# # if <булево значение>:

# a = 10

# if a > 5:
#     print(1)
# elif a % 2 == 0: 
#     print(2)
# elif a == 4:
#     print(4)

# else:
#     print(5)

# print(3)

#Task


# m = int (input("Введите первое значение: "))
# n = int (input("Введите первое значение: "))
# if n == 0:
#     print("делить на 0 нельзя")
#     exit()

# if m % n == 0:
#     print (f"Частное от деления {m} на {n} -> {m/n}")

# else:
#     print("m на n нацело не делится")

# #==========================================================
# if m % n == 0 and n != 0:
#     print (f"Частное от деления {m} на {n} -> {m/n}")

# else:
#     print("m на n нацело не делится")

# #==========================================================

# if n != 0:
#     if m % n == 0:
#         print (f"Частное от деления {m} на {n} -> {m/n}")
#     else:
#         print("m на n нацело не делится")
# #==========================================================
# result = "четное" if m % n == 0 else "нечетное"
# print(result)

# number = int(input("Введите дву значное число: "))
# digit = number % 10
# tens = number // 10
# if number**2 == 4*(digit**3 + tens**3):
#     print("равен")
# else:
#     print("не равен")
# #==========================================================
# Дано двузначное число Определить
# 1) Является ли сумма его цифр двузначным числом
# 2) Больше ли числа а сумма его цифр

number = int(input("Введите дву значное число: "))
if 10<= (number % 10) + (number // 10) <= 99:
    print("является")
          
if (number % 10) + (number // 10) >= 10 and (number % 10) + (number // 10) <= 99:
    print("является")
    